<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bb4d46fabe5ea312f3f37e5108f46dbec6b9c8e2fac373432748840f73ef6e60","plan_job_ref":"Job PR on main #32 at https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/9047498819","plan_out_hash":"4883bf5402175ec8110987ae3d8dbbf721ecbab3569fbc50c69e8751d274dff0","plan_hash":"a8d29ddd19944cc26a78a91925120ec44f5f780d4a1204d80c2bc0e0fa489c12","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __apps/platform/terraform/__
With backend config files: `apps/platform/terraform/backends/prod.s3.tfbackend`
With var files: `apps/platform/terraform/vars/prod.tfvars`
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs-web-app.module.alb_ingress.data.aws_lb_target_group.default[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lb_target_group" "default" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = (known after apply)
+       health_check                       = (known after apply)
+       id                                 = (known after apply)
+       lambda_multi_value_headers_enabled = (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = (known after apply)
+       port                               = (known after apply)
+       preserve_client_ip                 = (known after apply)
+       protocol                           = (known after apply)
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = (known after apply)
+       slow_start                         = (known after apply)
+       stickiness                         = (known after apply)
+       tags                               = (known after apply)
+       target_type                        = (known after apply)
+       vpc_id                             = (known after apply)
    }

  # module.ecs-web-app.module.alb_ingress.aws_lb_listener_rule.unauthenticated_paths[0] will be updated in-place
!~  resource "aws_lb_listener_rule" "unauthenticated_paths" {
        id           = "arn:aws:elasticloadbalancing:eu-central-1:381491873946:listener-rule/app/softkitit-prod/ef6d96e445dc3af8/4d1d425d9f90653b/47bd9ec93933ac2a"
        tags         = {}
#        (4 unchanged attributes hidden)

!~      action {
!~          target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:381491873946:targetgroup/softkit-nestjs-boilerplate-689a8/afb75a8e51df0c9d" -> (known after apply)
#            (2 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.ecs-web-app.module.alb_ingress.aws_lb_target_group.default[0] must be replaced
+/- resource "aws_lb_target_group" "default" {
!~      arn                                = "arn:aws:elasticloadbalancing:eu-central-1:381491873946:targetgroup/softkit-nestjs-boilerplate-689a8/afb75a8e51df0c9d" -> (known after apply)
!~      arn_suffix                         = "targetgroup/softkit-nestjs-boilerplate-689a8/afb75a8e51df0c9d" -> (known after apply)
!~      id                                 = "********************************************************************************************************************" -> (known after apply)
!~      ip_address_type                    = "ipv4" -> (known after apply)
!~      load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "softkit-nestjs-boilerplate-689a8"
+       preserve_client_ip                 = (known after apply)
        tags                               = {
            "Environment" = "prod"
            "Name"        = "softkit-nestjs-boilerplate-prod-platform"
            "Namespace"   = "softkit-nestjs-boilerplate"
            "Project"     = "platform"
            "Repository"  = "softkit-nestjs-boilerplate"
        }
!~      target_type                        = "ip" -> "instance" # forces replacement
#        (11 unchanged attributes hidden)

-       target_failover {}

#        (2 unchanged blocks hidden)
    }

  # module.ecs-web-app.module.ecs_alb_service_task.aws_ecs_service.ignore_changes_task_definition[0] will be created
+   resource "aws_ecs_service" "ignore_changes_task_definition" {
+       cluster                            = "arn:aws:ecs:eu-central-1:381491873946:cluster/softkitit-prod"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = false
+       health_check_grace_period_seconds  = 0
+       iam_role                           = "arn:aws:iam::381491873946:role/softkit-nestjs-boilerplate-prod-platform-service"
+       id                                 = (known after apply)
+       launch_type                        = (known after apply)
+       name                               = "softkit-nestjs-boilerplate-prod-platform"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Environment" = "prod"
+           "Name"        = "softkit-nestjs-boilerplate-prod-platform"
+           "Namespace"   = "softkit-nestjs-boilerplate"
+           "Project"     = "platform"
+           "Repository"  = "softkit-nestjs-boilerplate"
        }
+       tags_all                           = {
+           "Environment" = "prod"
+           "Name"        = "softkit-nestjs-boilerplate-prod-platform"
+           "Namespace"   = "softkit-nestjs-boilerplate"
+           "Project"     = "platform"
+           "Repository"  = "softkit-nestjs-boilerplate"
        }
+       task_definition                    = "softkit-nestjs-boilerplate-prod-platform:14"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "simple-web-app"
+           weight            = 1
        }

+       deployment_circuit_breaker {
+           enable   = true
+           rollback = true
        }

+       deployment_controller {
+           type = "ECS"
        }

+       load_balancer {
+           container_name   = "softkit-nestjs-boilerplate-prod-platform"
+           container_port   = 80
+           target_group_arn = (known after apply)
#            (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.ecs-web-app.module.ecs_codepipeline.module.codebuild.aws_s3_bucket.cache_bucket,
  on /tmp/terraform-data-dir/modules/ecs-web-app.ecs_codepipeline.codebuild/main.tf line 11, in resource "aws_s3_bucket" "cache_bucket":
  11:   acl           = "private"

Use the aws_s3_bucket_acl resource instead

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [PR on main #32](https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/9047498819)